# 육십갑자 체계를 일반화한 다음과 같은 상황을 생각해 보자. 
# N개의 문자열 s_1, s_2, s_3 …, s_N 과 M개의 문자열 t_1, t_2, t_3, …, t_M 이 있다. 
# 이들은 알파벳 소문자로만 이루어져 있다. 
# 1년은 두 문자열 s_1, t_1 을 이어붙인 이름을 가지고, 그 다음 해는 각각의 문자열 리스트에서 다음 순서에 해당되는 문자열을 이어붙인 이름을 가진다. 
# 만약 리스트에서 다음 순서가 없다면, 첫 원소로 돌아간다.

# 예를 들어, N = 3, M = 4, s = {“a”, “b”, “c”}, t = {“d”, “e”, “f”, “g”} 라고 하면 매년 아래 표처럼 이름이 붙여진다. 
# 일반적인 육십갑자 체계는 N = 10, M = 12 를 만족한다.

# 두 문자열 리스트와 Q개의 질문이 주어진다. 
# 각 질문으로 이름을 알고 싶은 년도의 숫자가 주어질 때, 그 이름을 반환하라.

# pic1 = "19185.png"

# [입력]
# 첫 번째 줄에 테스트 케이스의 수 TC가 주어진다. 이후 TC개의 테스트 케이스가 새 줄로 구분되어 주어진다. 각 테스트 케이스는 다음과 같이 구성되었다.
#  - 첫 번째 줄에는 각 문자열 리스트의 길이 N, M 이 주어진다. (1 ≤ N,M≤20)
#  - 다음 줄에는 N개의 문자열 s_1, s_2, s_3 …, s_N 이 주어진다.
#  - 다음 줄에는 M개의 문자열 t_1, t_2, t_3, …, t_M 이 주어진다.
#  - 다음 줄에는 정수 Q 가 주어진다.(1≤Q≤2020)
#  - 다음 Q개의 줄에는 이름을 알고 싶은 년도 Y가 주어진다.(1≤Y≤10^9)
#  - 주어지는 문자열들은 알파벳 소문자로만 이루어져 있고 그 길이가 10을 넘지 않는다.


# [출력]
# 각 테스트 케이스 마다 한 줄씩, 이름에 해당하는 Q개의 문자열을 입력 순서대로 출력하라.