# 식료품 가게의 주인인 철수는 대대적인 할인행사를 계획하고 있습니다. 
# 철수는 25% 할인된 가격으로 상점의 모든 품목을 판매하기로 했습니다. 
# 즉, 각 품목의 판매 가격은 정상 가격의 정확히 75%입니다. 
# 우연하게도 식료품 가게에서 판매하는 모든 물건의 정상가는 4의 배수인 정수이고, 고로 할인된 가격 역시 모두 정수입니다.

# 철수는 먼저 모든 판매 물품의 할인된 판매가격을 프린터로 출력했고, 또한 할인행사 종료 후 다시 쓸 모든 품목에 정상 가격표 역시 출력했습니다.

# 잠깐 자리를 비웠던 철수가 다시 가격표의 출력을 확인하기 위해서 프린터로 돌아와 보니, 공교롭게 프린터는 모든 물품의 할인가격과 정상가격을 한꺼번에 오름차순으로 정렬한 뒤 순서대로 출력하여 하나의 출력물 더미를 만들었습니다. 
# 예를 들어, 정상가격이 20, 80, 100인 경우 할인가격은 15, 60, 75이며 프린터의 인쇄 출력 더미는 오름차순으로 정렬된 15, 20, 60, 75, 80, 100 가격표들로 구성됩니다.

# 철수는 어느 가격표가 할인 가격표인지 구분할 수 없습니다. 이 상황에서 철수는 무엇이 할인가격표인지 구분해낼 수 있을까요?


# [입력]
# 첫 번째 줄에 테스트 케이스의 수 TC가 주어진다. 이후 TC개의 테스트 케이스가 새 줄로 구분되어 주어진다. 각 테스트 케이스는 다음과 같이 구성되었다.
# 첫 번째 줄에는 상점의 품목 수 N이 주어진다. (1 ≤ N ≤ 100)
# 두 번째 줄에는 프린터에서 인쇄한 2N개의 정수 Pi가 오름차순으로 주어진다. (1 ≤ Pi ≤ 10^9)


# [출력]
# 각 테스트 케이스 마다 한 줄씩, 물건의 할인가격에 해당하는 N개의 정수를 오름차순으로 정렬하여 출력하라.